<?php

/*
 * 24. Напечатать  натуральное  число  N :  
 * а) в  двоичной  системе  счисления;  
 * б) в шестнадцатеричной системе счисления.  
 */

$n = 30;
$res[10] = $n;
$i = 0;
$res[2] = 0;
while ($n != 0) {//преобразование в двоичную
    $ost = $n % 2;
    $res[2] += $ost * myPow(10, $i);
    $n /= 2;
    $n = (int) $n;
    $i++;
}
$h = [
    1 => 1,
    10 => 2,
    11 => 3,
    100 => 4,
    101 => 5,
    110 => 6,
    111 => 7,
    1000 => 8,
    1001 => 9,
    1010 => 'A',
    1011 => 'B',
    1100 => 'C',
    1101 => 'D',
    1110 => 'E',
    1111 => 'F',
];
$chislo2 = $res['2'];
while($chislo2!=0){//прееобразование в 16-ричную систему
    $res[16] = $h[ $chislo2%10000 ].$res[16];
    $chislo2 /= 10000;
    $chislo2 = (int)$chislo2;
}
print_r($res);//ключи соответствуют системам счислений

function myPow($numb, $stepen) {
    $res = 1;
    while ($stepen--) {
        $res *= $numb;
    }
    return $res;
}
